Tekla Open API Reference for Tekla Structures 2025
View.GetClipPlanes Method
Returns all the clip planes of the view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ClipPlaneCollection GetClipPlanes()
Public Function GetClipPlanes As ClipPlaneCollection
Return Value
Type: ClipPlaneCollection
The clip planes of the view.
Examples
 The following example shows how all ClipPlanes are deleted from the first visible view:
using System;
using System.Collections;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class GetClipPlanesExample
{
    public void GetClipPlanesExample1()
    {
        ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
        ViewEnum.MoveNext();
        View ActiveView = ViewEnum.Current;
        ClipPlaneCollection ClipPlanes = ActiveView.GetClipPlanes();
        if (ClipPlanes.Count > 0)
        {
            IEnumerator PlaneEnum = ClipPlanes.GetEnumerator();
            while (PlaneEnum.MoveNext())
            {
                ClipPlane CPlane = PlaneEnum.Current as ClipPlane;
                if (CPlane != null)
                    CPlane.Delete();
            }
        }
    }
}
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace